<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"        "http://www.w3.org/TR/html4/loose.dtd"><html lang="es"><head>	<meta http-equiv="content-type" content="text/html; charset=iso-8859-1">	<title>Ayuda de Phoenix Slides</title>	<meta name="AppleTitle" content="Ayuda de Phoenix Slides"></head><body><h1>Ayuda de Phoenix Slides</h1><h2>Introducci&oacute;n</h2><p>Phoenix Slides es un veloz programa de pase de diapositivas y un navegador de im&aacute;genes. Puede usarse para realizar transformaciones JPEG sin p&eacute;rdida y para ver datos EXIF. Requiere Mac OS X 10.3 o posterior.</p>Contenido:<ul>	<li><a href="#usage">Uso General</a></li>	<li><a href="#slides">Pase de Diapositivas </a></li>	<li><a href="#jpeg">Transformaciones JPEG</a></li>	<li><a href="#cats">Grupos/Categor&iacute;as</a></li>	<li><a href="#story">La historia </a></li>	<li><a href="#ack">Agradecimientos</a></li>	<li><a href="#vers">Hist&oacute;rico de versiones/Informaci&oacute;n de contacto</a></li></ul><h2><a name="usage"></a>Uso General </h2><p>Use el listado de directorios en la parte superior de la ventana para navegar a un directorio. Es posible arrastrar archivos o folders en la ventana o en el icono de la aplicaci&oacute;n. Inicie un pase de diapositivas haciendo click en el bot&oacute;n &quot;Pase de diapositivas&quot;, oprimiendo la tecla de Return, o haciendo doble click sobre la miniatura de la im&aacute;gen. </p><h3>Uso del listado de directorios</h3><p>Adicionalmente al click acostumbrado, tambi&eacute;n es posible introducir nombres de directorios para saltar directamente a ellos.</p><p>La primer columna del listado de directorio contiene una lista de los vol&uacute;menes montados. La lista se actualiza automaticamente cuando los discos son insertados o expulsados. La lista tambi&eacute;n se actualiza si una carpeta se mueve, renombra o elimina. Para refrescar el listado de cualquier otro cambio en el sistema de archivos (nuevos archivos, renombrar otras carpetas, etc.) haga click en el nombre de la carpeta y su contenido ser&aacute; actualizado.</p><p>Marque &quot;Subcarpetas&quot; para que el programa busque im&aacute;genes en todos los subdirectorios. Cuando se construyan las listas de im&aacute;genes recorrer&aacute; los subdirectorios seg&uacute;n los encuentre (la b&uacute;squeda es primero por profundidad. Esta caracter&iacute;stica puede resultar divertida cuando se mira dentro de los empaquetados de las aplicaciones.</p><p>Es posible arrastrar una carpeta o un archivo en esa carpeta a la ventana para saltar a esa carpeta. Si se arrastran archivos de im&aacute;genes ser&aacute;n seleccionados en la vista de las miniaturas (Tambi&eacute;n se puede arrastrar archivos que no sean im&aacute;genes; esto es una caracter&iacute;stica. :-)</p><p>Cuando se seleccione una carpeta para navegar, el programa construye una lista de archivos de imagen (basados en la extensi&oacute;n como .jpg y el tipo de c&oacute;digo de cuatro letras como 'PICT').  Phoenix Slides soporta todos los tipos de imagen soportados por Mac OS X (esto es, todo lo que NSImage pueda leer).</p><h3>Miniaturas</h3><p>Despu&eacute;s de obtener una lista de nombres de archivos, el programa inicia la generaci&oacute;n de miniaturas de cada una de las im&aacute;genes. Las miniaturas son guardadas en memoria y descartadas cuando se cierra el programa.</p><p>Phoenix Slides despliega informaci&oacute;n b&aacute;sica (nombre, tama&ntilde;o, dimensiones) acerca de los archivos actualmente seleccionados en la barra de estado en la parte inferior de las ventana.</p><p>Es posible cambiar el tama&ntilde;o de las miniaturas para desplegarlos entre 40 y 160 pixeles de ancho. (Internamente se almacenan 160 pixeles).</p><p>Para los interesados: Phoenix Slides usa la bibliotega Epeg para crear miniatuuras de los JPEGs. Los archivos que no sean JPEG, por el contrario, ser&aacute;n miniaturizados lentamente. =P </p><h3>Seleccionar im&aacute;genes </h3><p>Puede seleccionar im&aacute;genes para iniciar un pase de diapositivas con ellas, moverlas a la papelera, ubicarlas en el Finder, o establecer una imagen como fondo de escritorio. Para seleccionar una imagen, haga click en ella. Haga un shift-click para extender la selecci&oacute;n; command-click para revertir la selecci&oacute;n. Tambi&eacute;n puede seleccionar im&aacute;genes arrastrando alrededor de ellas (en el espacio en blanco).</p><p>Use las teclas de flechas en el teclado para cambiar la selecci&oacute;n (esto s&oacute;lo funciona cuando solo una imagen est&aacute; seleccionada).</p><h3>Arrastrar im&aacute;genes </h3>Arrastre im&aacute;nes a otro programa para abrirlas, o al Finder para copiar los archivos.<h3>Revelar en el Finder</h3><p>La entrada del men&uacute; &quot;Revelar en el Finder&quot; puede ser &uacute;til para operaciones de archivos que est&aacute;n m&aacute;s all&aacute; de los l&iacute;mites de arrastrar y soltar. Si se han seleccionado una o m&aacute;s im&aacute;genes, Phoenix Slides le indica al Finder mostrar esos archivos. Si tiene &quot;Subcarpetas&quot; seleccionadas y los archiso son de diferentes directorios, el resultado final es responsabilidad del Finder. Si no hay archivos seleccionados, Phoenix Slides simplemente abre la carpeta seleccionada en el Finder.</p><h2><a name="slides"></a>Pase de diapositivas</h2><p>Iniciar un pase de diapositivas har&aacute; dos cosas de acuerdo a la selecci&oacute;n actual:</p><ul>	<li>Si no hay elementos seleccionados, comienza un pase de diapositivas con todas las im&aacute;genes, comenzando por la primera.</li>	<li>Si un elemento est&aacute; seleccionado, comienza un pase de diapositivas de todas las im&aacute;genes, iniciando con la imagen seleccionada.</li>	<li>Si hay varios elementos seleccionados, comienza un pase de diapositivas &uacute;nicamente con las im&aacute;genes seleccionadas.</li></ul><p>Puede comenzar un pase de diapositivas en cualquier momento al compilar la lista de archivos (no es necesario esperar a que las miniaturas sean cargadas).</p><h3>Durante el pase de diapositivas </h3><p>Puede controlar el pase de diapositivas usando el teclado. Presione 'h' o '?' durante el pase de diapositivas para ver todos los comandos (mostrados m&aacute;s abajo). Si necesita acceder al men&uacute;, mueva el apuntador a la parte superior de la pantalla.</p><p>Presione una de las teclas de n&uacute;mero (1-9) para avanzar autom&aacute;ticamente el pase de diapositivas cada 1-9 segundos. Presione la barra espaciadora para detener o continuar el pase autom&aacute;tico. Presione '0' para detenerlo. Presionar una tecla para retroceder una diapositiva tambi&eacute;n detiene el pase autom&aacute;tico.</p><p>Las im&aacute;genes m&aacute;s peque&ntilde;as que la pantalla ser&aacute;n mostradas en su tama&ntilde;o normal por defecto. Para expandirlas al tama&ntilde;o de la pantalla, seleccione &quot;Agrandar im&aacute;genes peque&ntilde;as&quot; del men&uacute; del Pase de Diapositivas&quot; (o presione command-E).</p><p>Para magnificar una imagen, use las teclas +/- (especialmente conveniente en el teclado num&eacute;rico). Use '=' para regresar al tama&ntilde;o normal. Puede regresar al tama&ntilde;o por defecto (ajustar a la pantalla) presionando '*'. Cuando la imagen es m&aacute;s grande que la pantalla puede usar las teclas de n&uacute;mero en el teclado num&eacute;rico (excepto el 5) para desplazarse por la imagen. La rueda de desplazamiento del rat&oacute;n tambi&eacute;n funciona.</p><p>Por lo normal el pase de diapositivas se detiene cuando se llega a la &uacute;ltima im&aacute;gen. Puede habilitar el modo continuo cen el men&uacute; de Pase de Diapositivas. Esto provocar&aacute; que el pase de diapositivas muestre la primer imagen despu&eacute;s de la &uacute;ltima. Si se combina con el avance autom&aacute;tico, esto generar&aacute; un pase de diapositivas sin fin.</p><p>Puede trasladarse a otros programas mientras el pase de diapositivas est&aacute; activo (usando command-tab, por ejemplo). El pase de diapositivas continuar&aacute; felizmente detr&aacute;s de las otras ventanas. Haga click sobre la ventana del pase de diapositivas para traerla al frente.</p><h3>Ficha de comandos del pase de diapositivas </h3><table><tr>  <td>barra espaciadora </td>  <td>detener/continuar avance autom&aacute;tico, ir a la siguiente imagen </td></tr><tr><td>&rarr;&darr;</td><td>ir a la siguiente </td></tr><tr><td>&larr;&uarr;</td><td>ir a la anterior </td></tr><tr>  <td>avanzar p&aacute;gina </td>  <td>adelantar 10 </td></tr><tr>  <td>retrodecer p&aacute;gina </td>  <td>regresar 10 </td></tr><tr>  <td>inicio</td>  <td>ir a la primer imagen</td></tr><tr>  <td>fin</td>  <td>ir a la &uacute;ltima imagen</td></tr><tr><td>0</td><td>detener el avance autom&aacute;tico </td></tr><tr><td>1-9</td><td>avance autom&aacute;tico cada n segundos </td></tr><tr><td>!</td><td>avance autom&aacute;tico cada medio segundo</td></tr><tr><td>h, ?</td><td>mostrar/ocultar esta ficha </td></tr><tr><td>i</td><td>mostrar/ocultar nombre del archivo </td></tr><tr><td>&#8679;I</td><td>ver más tags EXIF</td></tr><tr><td>F2-F12</td><td>asignar al grupo n </td></tr><tr><td>&#8984;F2-F12</td><td>modificar la asignaci&oacute;n de grupo</td></tr><tr><td>F1</td><td>eliminar la asignaci&oacute;n de grupo </td></tr><tr><td>r</td><td>rotar a la derecha  (90° a las manecillas del reloj)</td></tr><tr><td>l</td><td>rotar a la izquierda  (90° al contrario de las manecillas)</td></tr><tr><td>&#8984;E</td><td>agrandar im&aacute;genes peque&ntilde;as</td></tr><tr><td>+/-</td><td>zoom in/out</td></tr><tr><td>=</td><td>actual pixels</td></tr><tr><td>*</td><td>acercar hasta ajustar </td></tr><tr><td>1-9 (num keypad)</td><td>desplazar imagen agrandada</td></tr><tr><td>esc, q</td><td>terminar el pase de diapositivas </td></tr></table><h2><a name="jpeg"></a>Transformaciones JPEG</h2><p>Phoenix Slides puede realizar transformaciones sin p&eacute;rdida en archivos JPEG. De hecho, usa c&oacute;digo de jpegtran (incluyendo el parche EXIF), y soporta la mayor&iacute;a de las opciones avanzadas, que se explican brevemente m&aacute;s abajo:</p><p><strong>Deshacerse de los bloques de las orillas no transferibles:</strong> - La rotaci&oacute;n sin p&eacute;rdida s&oacute;lo es perfecta para im&aacute;genes cuyo tama&ntilde;o es un m&uacute;ltiplo del tama&ntilde;o de bloque iMCU, t&iacute;picamente 8 o 16. Los bloques &quot;imperfectos&quot; en las orillas pueden ser recortados, si se desea, aunque por supuesto esta es una operaci&oacute;n irreversible. Aqu&iacute; hay m&aacute;s informaci&oacute;n tomada de la documentaci&oacute;n de la documentaci&oacute;n de jpegtran:</p><pre>jpegtran's default behavior when transforming an odd-size image is designedto preserve exact reversibility and mathematical consistency of thetransformation set.... Transpose is able to flip the entire imagearea.  Horizontal mirroring leaves any partial iMCU column at the right edgeuntouched, but is able to flip all rows of the image.  Similarly, verticalmirroring leaves any partial iMCU row at the bottom edge untouched, but isable to flip all columns.  The other transforms can be built up as sequencesof transpose and flip operations; for consistency, their actions on edgepixels are defined to be the same as the end result of the correspondingtranspose-and-flip sequence.</pre><p><strong>Convertir en progresivo </strong> - Crea im&aacute;genes aptas para un despliegue incremental en enlaces de comunicaci&oacute;n lentos. Los archivos JPEG progresivos consisten en una serie de muestras de calidad incremental.</p><p><strong>Optimizar la tabla de Huffmann </strong> - M&aacute;s lento, pero crea archivos ligeramente m&aacute;s peque&ntilde;os.</p><p><strong>Escala de grises </strong> - Simplemente elimina la informaci&oacute;n de color (cromatizaci&oacute;n), dejando la informaci&oacute;n de grises (luminosidad) intacta.</p><p><strong>Marcadores JPEG </strong> - Varias opciones para eliminar los comentarios y otros datos JPEG (como la informaci&oacute;n EXIF) almacenada en el encabezado de los archivos JPEG.</p><p>Phoenix Slides le advierte cada vez que intente una operaci&oacute;n irreversible.</p><h2><a name="cats"></a>Grupos/Categor&iacute;as</h2><p>Phoenix Slides provee un medio para agrupar o categorizar temporalmente im&aacute;genes. Durante un pase de diapositivas, presione una de las teclas F2-F12 paraq ver im&aacute;genes en el grupo correspondiente. Tambi&eacute;n puede presionar command-F2 (hasta F12) para cambiar la asignaci&oacute;n de una imagen a un grupo tanto en el pase de diapositivas como en la vista de miniaturas. Para borrar todas las asignaciones de categor&iacute;as, presione F1 durante un pase de diapositivas, o command-F1 en la vista de miniaturas. Asignar im&aacute;genes a grupos puede resultar &uacute;til para operaciones en lote, por ejemplo, seleccioanr un grupo de im&aacute;genes para llevar a cabo una operaci&oacute;n de rotaci&oacute;n.</p><p>Evidentemente no podr&aacute; usar las teclas de funci&oacute;n que el sistema u otras aplicaciones hayan reservado para otras cosas, siendo las telcas F9-F12 las tradicionales para Expos&eacute; y Dashboard dos de los ejemplos m&aacute;s notables. Sin embargo, casi siempre es posible encontrar una soluci&oacute;n a esto al presionar ya sea la tecla de control o de option cuando se presione F1-F12.</p><p>Las categor&iacute;as son temporales y se perder&aacute;n cuando se cierre Phoenix Slides. Debe pensar en esta funcionalidad como un mecanismo avanzado de selecci&oacute;n.</p><h2><a name="story"></a>La historia de Phoenix Slides</h2><p>Un d&iacute;a, Jim (el profesor en cargo del proyecto de investigaci&oacute;n en el que trabajo) trajo unos CDs con fotograf&iacute;as de Tailandia. Veamos estas fotograf&iacute;as, dijo. Buscamos alg&uacute;n programa adecuado en las Macs de la oficina, sin &eacute;xito. Terminamos por usar el modo de pantalla completa de Preview. Fue... doloroso. Ni siquiera pudimos rotar las im&aacute;genes en modo de pantalla completa. Por ello decid&iacute; escribir mi propio programa.</p><p>&iquest;Recuerda Curator, el ya abandonado programa organizador de im&aacute;genes de Caffeine Software? Es bueno, pero (1) est&aacute; muerto, (2) el listado de directorio se comporta de forma rara, y (3) hay que esperar a que se generen las vistas de miniaturas para poder comenzar un pase de diapositivas (&iquest;por qu&eacute;?). Yo quer&iacute;a que mi programa solucionara esos problemas, as&iacute; que Phoenix Slides est&aacute; inspirado en parte por Curator.</p><p>&iquest;Por qu&eacute; Phoenix? Adem&aacute;s del significado hist&oacute;rico, el fenix tambi&eacute;n es mostrado prominentemente en la bandera de San Francisco (donde nos ubicamos). Adem&aacute;s son un seguidor de los Fawkes (el fenix de Dumbledore en los libros de Harry Potter).</p><h2><a name="ack"></a>Agradecimientos</h2><p>Gracias a David Chow y su incre&iacute;ble capacidad para descomponer mi programa.</p><p>Gracias a C&eacute;sar Pi&ntilde;era por la traducci&oacute;n al espa&ntilde;ol; a Thomas Steg de Karlsruhe (Alemania) por la traducci&oacute;n al Alem&aacute;n y la documentaci&oacute;n;	a Laurent Bovet por la traducci&oacute;n francesa;	y a Silvano Dotti por la traducci&oacute;n italiana.</p><p>Gracias a todos los que hacen su c&oacute;digo fuente disponible para aprender o adaptar a otros prop&oacute;sitos, incluyendo rasterman (Epeg), Allan Hsu (Magic Lantern), Marc Liyanage (EpegWrapper), yRainer Brockerhoff (RBSplitView).</p><p>Gracias a Adri&aacute;n Gonz&aacute;lez de <a href="http://www.icestorm.com/">The Icestorm Network</a> por proveer generosamente espacio en el servidor.</p><p>Y finalmente, gracias a mi antig&uuml;o jefe en mi trabajo sin futuro por &quot;despedirme&quot;. Que Phoenix Slides sea una prueba de las ventajas del desempleo.</p><h2>Se requiere ayuda </h2><p>Se busca ayuda para las traducciones: Si desea traducir Phoenix Slides a su idioma sea tan amable de <a href="http://blyt.net/Contact.html">ponerse en contacto conmigo</a>.</p><p>Tambi&eacute;n puede contribuir ofreciendo ayuda para la programaci&oacute;n o realizando donativos de libros(Cocoa, perl, ling&uuml;&iacute;stica), dinero, or materiales de patinaje. </p><h2><a name="vers"></a>Historial de cambios </h2>2009.08.31 1.2.6<ul>	<li>works with Mac OS X 10.6 (Snow Leopard)</li>	<li>when slideshow is running, slideshow no longer switches screens</li>	<li>when running in random AND loop mode, re-randomize at the start of each loop</li>	<li>fixed crash on badly formatted ("field type mismatch") EXIF headers</li>	<li>improved Italian localization</li></ul>2009.03.23 1.2.5<ul>	<li>fixed - no more white line in scaled-down images</li>	<li>new preference for larger thumbnails</li>	<li>new preference to allow moving files/making aliases</li>	<li>new - hit 'f' to flip during slideshow</li>	<li>new - shift-space goes back</li>	<li>new - set thumbnail background color</li>	<li>fixed - dragging to trash can now removes thumbnail from view (bug introduced in 1.2)</li>	<li>fixed bug when reading JPEG Comments with 8-bit characters</li></ul>2007.05.01 1.2.4<ul>	<li>fixed crash when reading certain non-standard EXIF headers</li>	<li>fixed sporadic hangs (spinning wheel cursor, often affected Intel machines)</li>	<li>fixed white line drawing artifacts in thumbnail view</li>	<li>some internal changes to work with resolution independence (in anticipation of Leopard)</li></ul>2007.04.20 1.2.3<ul>	<li>New icon (thanks to Takeshi Gondo)</li>	<li>Selected thumbnail now matches last viewed slide</li>	<li>Items now sorted by filename (Finder order)</li>	<li>Skips folders named "Thumbs" (for better iPhoto library browsing)</li>	<li>fixed - exif thumb popup menu now hides when info window is collapsed</li>	<li>fixed - ghost of last thumbnail no longer remains when deleting a file</li>	<li>fixed - jpeg transformations no longer cause menubar/dock to show during slideshows</li>	<li>Italian localization</li></ul>2006.10.25 1.2.2<ul>	<li>Auto-rotate JPEGs according to EXIF Orientation tag</li>	<li>JPEG rotations now reset orientation tag, fixing an inconsistency with Preview</li>	<li>reset orientation tag, delete/rebuild EXIF thumbnail</li>	<li>JPEG rotations also rotate EXIF thumbnail</li>	<li>left- and right-click now go forward/back in slideshow; double-click ends slideshow</li>	<li>scroll wheel can be used to navigate slideshow</li>	<li>command-+/- can now zoom in/out slideshow</li>	<li>hand cursor appears when you can drag zoomed images</li>	<li>new and improved preferences window</li>	<li>set slideshow background color/transparency (perhaps not very useful but very cool)</li>	<li>resizable columns in the folder browser</li>	<li>fixed crash when exiting slideshow with images waiting to be cached (also made currentIndex volatile)</li>	<li>fixed: jpeg files with non-EXIF APP1 tags no longer cause problems with selection/info display</li>	<li>fixed: jpeg rotation during slideshow didn't update if "don't change modification date" was checked</li>	<li>fixed: rotating and trashing files in thumbnails window will now cause slideshow to update too</li>	<li>French localization</li></ul>2006.01.03 1.2.1<ul>	<li>A&ntilde;adido - despliegue de la informaci&oacute;n EXIF durante el pase de diapositivas</li>	<li>A&ntilde;adido - despliegue de todas las im&aacute;genes en su tama&ntilde;o real durante el pase de diapositivas</li>	<li>Abrir archivos inicia el pase de diapositivas de inmediato</li>	<li>Las preferencias de zoom permanecen hasta el cierre del programa</li>	<li>Opci&oacute;n para conservar las fechas de modificaci&oacute;n al realizar transformaciones JPEG sin p&eacute;rdida</li>	<li>Corregido - Elementos del men&uacute; habilitados incorrectamente durante el pase de diapositivas</li>	<li>Corregido - Defecto en el desplazamiento con el teclado num&eacute;rico 2, 4, 6, 8</li>	<li>Corregido - Defecto en el dibujo al esconder la ficha de comandos del pase de diapositivas</li>	<li>Corregido - Defecto en la locaci&oacute;n del pase de diapositivas con varias pantallas</li>	<li>Compilaci&oacute;n para arquitecturas PPC y x86</li>	<li>Traducci&oacute;n al espa&ntilde;ol </li></ul>2005.08.03 1.2<ul>	<li>Acercamiento y alejamimento durante el pase de diapositivas</li>	<li>Transformaciones y rotaciones sin p&eacute;rdida JPEG</li>	<li>Ventana de informaci&oacute;n con informaci&oacute;n EXIF, comentarios JPEG, etc.</li>	<li>Capacidad para abrir varias ventanas de miniaturas</li>	<li>Capacidad para asignar im&aacute;genes a grupos o categor&iacute;as temporales</li>	<li>Aleatoreidad en el pase de diapositivas</li>	<li>Carga ligeramente m&aacute;s r&aacute;pida en la generaci&oacute;n de miniaturas para im&aacute;genes que no son JPEG</li>	<li>Verificaci&oacute;n autom&aacute;tica de la versi&oacute;n</li>	<li>Traducci&oacute;n al alem&aacute;n </li>	<li>Corregido - Las preferencias no siempre son almacenadas al salir</li></ul>2005.07.06 1.1<ul>	<li>Barra de estado (nombre, tama&ntilde;o, dimensiones)</li>	<li>Cambio de tama&ntilde;o de las miniaturas </li>	<li>GIFs animados en el pase de diapositivas</li>	<li>Opci&oacute;n en el pase de diapositivas para ajustar las im&aacute;genes peque&ntilde;as a la pantalla</li>	<li>Presionar 1-9 inicia el autoavance de inmediato</li>	<li>Presionar la barra espaciadora detiene o contin&uacute;a el avance autom&aacute;tico</li>	<li>Optimizaciones de velocidad y memoria en la vista de miniaturas</li>	<li>Navegaci&oacute;n de las miniaturas con las teclas de flechas</li>	<li>La navegaci&oacute;n de carpetas muestra los vol&uacute;menes montados</li>	<li>El listado de carpetas autom&aacute;ticamente se actualiza al montar un vol&uacute;men, mover/renombrar/eliminar una carpeta</li>	<li>Corregido - la vista de miniaturas algunas veces se saltaba im&aacute;genes</li>	<li>Corregido - el programa se colgaba ocasionalmente al arranque</li></ul>2005.04.28 1.0 primer liberaci&oacute;n p&uacute;blica.<h2>Contacto/Licencia</h2><p>Sitio web oficial:<a href="http://blyt.net/phxslides/">http://blyt.net/phxslides/</a></p><p>Adem&aacute;s, sea tan amable de enviar por <a href="mailto:dyupc@blyt.net">email</a> sugerencias, reportes de bugs y comentarios.</p><!-- Creative Commons License --><a rel="license" href="http://creativecommons.org/licenses/by-nc-sa/2.0/"><img alt="Creative Commons License" border="0" src="http://creativecommons.org/images/public/somerights20.gif"></a><br> Este producto est&aacute; licenciado bajo una licencia de tipo <a rel="license" href="http://creativecommons.org/licenses/by-nc-sa/2.0/">Creative Commons License</a>.<!-- /Creative Commons License --><!--<rdf:RDF xmlns="http://web.resource.org/cc/"    xmlns:dc="http://purl.org/dc/elements/1.1/"    xmlns:rdf="http://www.w3.org/1999/02/22-rdf-syntax-ns#"><Work rdf:about="">   <dc:title>Phoenix Slides</dc:title>   <dc:date>2005-2006</dc:date>   <dc:rights><Agent>      <dc:title>Dominic Yu</dc:title>   </Agent></dc:rights>   <license rdf:resource="http://creativecommons.org/licenses/by-nc-sa/2.0/" /></Work><License rdf:about="http://creativecommons.org/licenses/by-nc-sa/2.0/">   <permits rdf:resource="http://web.resource.org/cc/Reproduction" />   <permits rdf:resource="http://web.resource.org/cc/Distribution" />   <requires rdf:resource="http://web.resource.org/cc/Notice" />   <requires rdf:resource="http://web.resource.org/cc/Attribution" />   <prohibits rdf:resource="http://web.resource.org/cc/CommercialUse" />   <permits rdf:resource="http://web.resource.org/cc/DerivativeWorks" />   <requires rdf:resource="http://web.resource.org/cc/ShareAlike" /></License></rdf:RDF>--><p>Copyright 2005-2007 by Dominic Yu. Este software es gratis y de c&oacute;digo abierto. Usted puede usarlo de forma gratuita para prop&oacute;sitos no comerciales. Los trabajos derivados deben dar cr&eacute;dito a mi y deben ser compartidos bajo la misma licencia, salvo que se obtenga permiso por escrito de mi que indique lo contrario.</p></body></html>